<a href="https://colab.research.google.com/github/rifrif12/rifrif12/blob/main/Use_Sql_Query_in_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3
import pandas as pd

In [ ]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('baru.db')
print("Opened database successfully");

conn.execute('''CREATE TABLE IF NOT EXISTS Table_B(Name VARCHAR(7), 
                                                   Age INT, 
                                                   City VARCHAR(13));''')
conn.execute('''CREATE TABLE IF NOT EXISTS Table_A(Country VARCHAR(9), 
                                                   Region VARCHAR(14), 
                                                   City VARCHAR(13));''')



conn.commit()

print("Table created successfully");

Opened database successfully
Table created successfully

In [ ]:
# INSERTING VALUES

conn.execute("INSERT INTO Table_B VALUES('James',30,'Jakarta Pusat');")
conn.execute("INSERT INTO Table_B VALUES('Anita',26,'Jakarta Pusat');")
conn.execute("INSERT INTO Table_B VALUES('Daniel',40,'Surabaya');")
conn.execute("INSERT INTO Table_B VALUES('Hudson',44,'Medan');")
conn.execute("INSERT INTO Table_B VALUES('Gwen',22,'Surabaya');")
conn.execute("INSERT INTO Table_B VALUES('Roberto',25,'Medan');")
conn.execute("INSERT INTO Table_A VALUES('Indonesia','Jakarta Raya','Jakarta Pusat');")
conn.execute("INSERT INTO Table_A VALUES('Indonesia','Jawa Timur','Surabaya');")
conn.execute("INSERT INTO Table_A VALUES('Indonesia','Sumatera Utara','Medan');")

conn.commit()

In [ ]:
query = ''' select  b.Name,
                    b.Age,
                    b.City,
                    a.Region,
                    a.Country
             from Table_A a inner join Table_B b
             on a.City=b.City;
        '''

In [ ]:
data = pd.read_sql_query(query, conn)
data

      Name  Age           City          Region    Country
0    Anita   26  Jakarta Pusat    Jakarta Raya  Indonesia
1    James   30  Jakarta Pusat    Jakarta Raya  Indonesia
2   Daniel   40       Surabaya      Jawa Timur  Indonesia
3     Gwen   22       Surabaya      Jawa Timur  Indonesia
4   Hudson   44          Medan  Sumatera Utara  Indonesia
5  Roberto   25          Medan  Sumatera Utara  Indonesia